export const globalMessages = [
  { conditional: null, text: 'Тыкай по чату, чтобы продолжить! :3' },
  {
    conditional: null,
    text: 'Не переживай, текста будет не так много, не бойся! ;) ',
  },
  {
    conditional: null,
    text: 'Я не знал, что подарить... Простую открытку не хотел дарить, а что-то особенное не придумал.',
  },
  {
    conditional: null,
    text: 'Да, скинул тебе мем про 14. Ты что-то загрустила, вот и решил сделать что-то, чтобы поднять тебе настроение!',
  },
  {
    conditional: null,
    text: 'Изначально план был совсем другим, но твоя грусть подтолкнула меня на то, что получилось. Надеюсь, тебе понравится.',
  },
  {
    conditional: null,
    text: 'Текст пишу в тот день, когда меня нагло кинули... В Валорант со мной играть не пошла, вот так вот! :(',
  },
  {
    conditional: null,
    text: 'Да, я обиделся, и что? Буду тебе напоминать об этом, чтобы тебе было стыдно! ;) ',
  },
  {
    conditional: null,
    text: 'Утро, а я не могу уснуть. Решил доделать всё за сегодня. Всё, больше править не буду, пускай будет так.',
  },
  {
    conditional: null,
    text: 'Тут ещё были шутки, пакости такие... Они останутся, но, может, они будут не совсем в тему, ну да ладно!',
  },
  {
    conditional: null,
    text: 'Раньше это было шуточное поздравление, а теперь хочется чего-то посерьезнее... так что держи!',
  },
  {
    conditional: null,
    text: 'Заранее прошу прощения, если что-то не так напишу... ты же меня знаешь.',
  },
  {
    conditional: null,
    text: 'Думал, будет проще это всё написать... но нет, не получилось. :)',
  },
  { conditional: null, text: 'Тут тоже тяжело... но я справлюсь!' },
  {
    conditional: null,
    text: 'Ооо, ты только что написала! Сказала, чтоб я шёл спать... Это было приятно! :3',
  },
  {
    conditional: null,
    text: 'Мы поболтали, и я думаю, ты уже вспомнила... Хотя, наверное, нет, потому что я сам уже забыл, хаха.',
  },
  { conditional: null, text: 'Ах да, ты же обманщица, спать не пошла!' },
  {
    conditional: null,
    text: 'Отправил гифку, а ты из сети вышла! Хахаха, заставил всё-таки! Правильно сделал — спать обязана!',
  },
  {
    conditional: null,
    text: 'Честно, не знаю, что мне тебе тут сказать... Наверное, спасибо за терпение! :)',
  },
  {
    conditional: null,
    text: 'Ценю, что терпишь все мои выходки. Я бы сам давно с собой не общался! :D',
  },
  {
    conditional: null,
    text: 'Честно, думал, что если буду меньше с тобой общаться, будет проще... Но нет, не было!',
  },
  {
    conditional: null,
    text: 'Чувства никуда не ушли, да и не хочу, чтобы уходили... Ты и сама это замечаешь, я это точно скрывать не могу.',
  },
  {
    conditional: null,
    text: 'Раньше пытался скрыть, а сейчас, когда ты всё знаешь, зачем мне это скрывать?',
  },
  { conditional: null, text: 'Так что да... всё ещё люблю!' },
  {
    conditional: null,
    text: 'Ладно, самая сложная часть пройдена! Теперь будет проще... ура! :D',
  },
  {
    conditional: null,
    text: 'Мини-игры ждут! Пройдёшь — будет прикол, не пройдёшь — не будет, хехе.',
  },
  {
    conditional: null,
    text: 'Не стал делать что-то суперсложное или грандиозное, просто сделал прикольно, чтоб тебе было весело.',
  },
  {
    conditional: null,
    text: 'Изначально думал сделать прям "вау", но понял, что ты мне просто картинку скинешь... Зачем тратить время?',
  },
  {
    conditional: null,
    text: 'Я и так трачу много сил и времени на тебя... Так что не жалуйся, окей? ;)',
  },
  {
    conditional: null,
    text: 'Пока думал над текстом, уснул на 15 минут... или 30. Не понял, короче, уже 9 утра... всё хорошо!',
  },
  { conditional: null, text: 'Счастья, удачи и любви тебе, самое главное!' },
  {
    conditional: null,
    text: 'Обходи стороной всех неугодных, даже не обращай внимания на них. Ты достойна только лучшего!',
  },
  {
    conditional: null,
    text: 'Ты лучше их всех! Если бы была хуже, я бы с тобой не общался, так что хватит там себя винить за все грехи мира.',
  },
  { conditional: null, text: 'Целую в лобик, если можно, конечно... ;)' },
  { conditional: null, text: 'Ну что, вроде всё, что хотел, написал!' },
  {
    conditional: null,
    text: 'Первое испытание! Пройди змейку, набери 30 очков, чтобы продолжить... Если хочешь доступ к секретной информации, набери 50!',
  },
  { conditional: 'snake-game', text: 'Поздравляю с прохождением! Умничка!' },
  {
    conditional: null,
    text: 'Хочу поплакать немного, думаю, сейчас самое время. Может, ты меня поймёшь?',
  },
  {
    conditional: null,
    text: 'Как я увлёкся этим поздравлением! Изначально тут вообще ничего не было, а теперь смотри, что получилось!',
  },
  {
    conditional: null,
    text: 'Ты сказала, чтоб я ждал до 14. Ну вот, зря ты это сказала, теперь я спать не смогу... :(',
  },
  {
    conditional: null,
    text: 'Надеюсь, ты открыла бонус. Я там достаточно написал, ты должна быть довольна! :P',
  },
  { conditional: null, text: 'Тут уже доставать тебя текстом не буду... )' },
  {
    conditional: null,
    text: 'Так, ну тут ещё одна мини-игра! Ты знаешь, что делать! Удачи тебе! ;)',
  },
  {
    conditional: 'smart-game',
    text: 'Поздравляю, ты прошла! Умничка! :D',
  },
  {
    conditional: null,
    text: 'Ты почти у цели! Ещё немного текста — и всё, финишная прямая!',
  },
  {
    conditional: null,
    text: 'Я хотел нарисовать открытку, но получилось не очень... Поэтому решил сделать так, как умею.',
  },
  {
    conditional: null,
    text: 'Надеюсь, тебе понравится. Очень надеюсь! :)',
  },
];
