<script setup lang="ts">
const myStore = useMyIndexStore();
const messageStore = useMessagesStore();

const handleSwapPage = () => {
  messageStore.clearCurrentEvent();
};
</script>

<template>
  <div
    class="flex h-[80%] overflow-y-scroll w-full flex-col items-center text-black"
  >
    <div class="content w-1/2 text-xl">
      <h1 class="my-7 text-3xl font-bold">Пасхальная страница</h1>
      <p class="mb-7">Я рад, если ты тут и читаешь это</p>
      <p class="mb-7">
        Я не придумал, что тут будет, поэтому я посмотрел нашу переписку. Всё,
        что тебе было интересно, когда я вкинул что-то и не написал конкретно,
        будет тут.
      </p>
      <p class="mb-7">
        Шрифт тоже взял обычный чтобы глаза не напрягать лишний раз
      </p>
      <p class="mb-7">
        Тут контекста нет, поэтому и проще написать. Догадываться, что к чему,
        придётся самой.
      </p>
      <p class="mb-7">
        Я написал, что меня всё бесит. В этой ситуации, конечно, было много
        таких сообщений, но именно в этой я не понимаю, что я забыл, я какой-то
        лишний в ней. Почему я всегда успокаиваю тебя? Писала бы Егору за
        поддержкой. Почему я? Мне тоже тяжело, на самом деле всё это даётся. Не
        в том плане что достала мне написывать, просто я то помагаю потому что
        ты мне не безразлична, но и не из дружеских побуждений. Извини, что это
        тут пишу. Но я всегда готов тебе помочь. Я сейчас не плачу, типа "не
        пиши мне больше, когда грустно". Напротив, я ценю это и всегда помогу.
      </p>
      <p class="mb-7">
        Не знаю, может, я уже это и говорил, а может, и нет. Тяжело мне с тобой
        общаться не в плане, что ты меня раздражаешь или ещё что-то, у меня
        улыбка до ушей натягивается, когда ты пишешь что-нибудь. Но вот,
        конечно, ещё бы как-то относиться к тебе более холодно — было бы вообще
        супер, но, увы, я так не могу, да и не хочу. Я писал это уже в основной
        части, тут меня ничего не сдерживает, я писал читай на свой страх и
        риск. Ещё я замечаю, как ты пытаешься не говорить про Егора, когда со
        мной общаешься. Не знаю, намеренно ли ты это делаешь или нет. Но
        спасибо, меня передёргивает от одной мысли о нём. Может, это странно, но
        мне кажется, что это нормальная реакция из-за всего, что было.
      </p>
      <p class="mb-7">
        Я тебе уже писал, что Саня знает про мою симпатию к тебе. Хорошо, что он
        думает, что это только симпатия, он бы доебал меня уже, ну пример того я
        тебе уже скидывал на днях. Каждый раз, когда мы сидели с тобой вдвоём и
        играли в ВАЛ, он после писал: "Зачем ты с ней общаешься? Оставь уже, иди
        дальше, она Егора уже выбрала, просто забудь да и всё". Или шутки свои
        вкидывает. Не знаю, как это вообще возможно — так легко отпустить. Я то
        вроде бы и забил, а всё, что внутри, говорит об обратном.
      </p>
      <p class="mb-7">
        Короче, если ты это и читаешь, можешь не говорить мне об этом. Я никогда
        не узнаю, прочитала ты это или нет. Но если захочешь обсудить что-то, я
        открыт к разговору.
      </p>
      <p class="mb-7">
        Точно могу тебе сказать, что пока что тебе бояться нечего. Я от тебя
        отдаляться не собираюсь. Я виню себя ещё за прошлый раз, так что больше
        такого не повторится :)
      </p>
      <p class="mb-7">
        А ещё я рисунок нарисовал для тебя. Ну, может, и не для тебя, короче,
        вот он. Не срисовывал, делал сам. Ну как не для тебя? Проект в фотошопе
        называется "frog dlya Dariny", так что видимо для тебя. Я когда рисовал,
        думал о тебе — ты ведь тут жаба. 🐸
      </p>
      <p class="mb-7 flex items-center justify-center">
        <img src="/frog-dlya-dariny.png" alt="" />
      </p>
      <p class="mb-7">
        Кривой он, конечно, но ты скажешь: "Вау, круто, молодец, спасибо
        большое!", так что не важно, кривой он или нет. 😄
      </p>
      <p class="mb-7">
        Еще меня бесит что ты фото в трусах мне не скидываешь но это мелочь :)
      </p>
      <p class="mb-7">
        Ладно, я думаю, и так уже много написал, как для секретного — даже через
        чур. Может, после моего предупреждения ты даже не зайдёшь сюда.
      </p>
      <p class="mb-7">
        Захочешь поговорить о чём-то после прочтения — пиши, буду отвечать
        максимально честно, если ты этого хочешь, конечно. Ну всё в твоих
        красивых, нежных, хрупких, изумительных руках.😊 Ладно у меня уже
        прилагательные закончились.
      </p>
      <p class="mb-7">Снизу кнопка отправит тебя дальше</p>

      <my-button class="mb-7" @click="handleSwapPage"> Продолжить </my-button>
    </div>
  </div>
</template>

<style scoped>
.content {
  font-family: 'Montserrat', serif !important;
}
</style>
